config.org
#+title: Doom Emacs Config

* Table of Contents :TOC:
- [[#general][General]]
  - [[#user-information][User Information]]
  - [[#auto-save-buffers][Auto save buffers]]
- [[#user-interface][User Interface]]
  - [[#font-and-themes][Font and Themes]]
  - [[#scale][Scale]]
  - [[#lines][Lines]]
  - [[#modeline][Modeline]]
- [[#org-mode][Org-mode]]
  - [[#heading-variable-font-sizes][Heading Variable font sizes]]
  - [[#tables][Tables]]
  - [[#zen-mode][Zen Mode]]
  - [[#org-roam-ui][Org Roam UI]]
- [[#coding][Coding]]
  - [[#corfu---completion][Corfu - Completion]]
  - [[#rust][Rust]]
  - [[#python][Python]]
- [[#preludes][Preludes]]
  - [[#packagesel][Packages.el]]

* General
** User Information
#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(setq user-full-name "Atri Hegde"
      user-mail-address "atri@example.com")
#+end_src

** Auto save buffers
Auto save all buffers on loss of focus or after 2 seconds idle.
#+begin_src emacs-lisp :tangle packages.el
;;; $DOOMDIR/packages.el -*- lexical-binding: t; no-byte-compile: t -*-
(package! super-save)
#+end_src


#+begin_src emacs-lisp
(after! super-save
  :init
  (setq super-save-auto-save-when-idle t)
  (setq super-save-idle-duration 2)
  (setq super-save-silent t)
  ;; But not for remote files
  (setq super-save-remote-files nil)
  :config
  (super-save-mode +1))

;; super save doesn't work without this...
(after! org
  (super-save-mode +1))
#+end_src

Save files quicker/easier
#+begin_src emacs-lisp
;; Save files quicker/easier
(map! :leader
      :desc "Save Buffer" "SPC" #'save-buffer)
#+end_src

Tab size
#+begin_src emacs-lisp
;; Tab size
(setq-default tab-width 2)
#+end_src

* User Interface
** Font and Themes
#+begin_src emacs-lisp
(setq doom-theme 'doom-palenight)

;; JetBrains Mono
(setq doom-font (font-spec :family "JetBrains Mono" :size 17 :weight 'medium)
      doom-variable-pitch-font (font-spec :family "JetBrains Mono" :sie 17 :weight 'medium))
;; Terminess Mono
;; (setq doom-font (font-spec :family "Terminess Nerd Font Mono" :size 17 :weight 'medium)
;;       doom-variable-pitch-font (font-spec :family "Terminess Nerd Font Mono" :size 17 :weight 'medium))
#+end_src

** Scale
Turn on big font mode for my HiDPI display
#+begin_src emacs-lisp
(when (display-graphic-p)
  (doom-big-font-mode t))
#+end_src

** Lines
Custom scroll margin for evil mode.
#+begin_src emacs-lisp
;; Default global scroll margin
(setq-default scroll-margin 7)

;; Apart from these modes which should have a scroll margin of 0
(dolist (mode '(Info-mode term-mode eshell-mode shell-mode erc-mode vterm-mode comint-mode))
  (add-hook (intern (format "%s-hook" mode))
            (lambda () (setq-local scroll-margin 0))))

;; Use relative line numbers
(setq display-line-numbers-type 'relative)
#+end_src

Make evil mode scroll to the next visual line.
#+begin_src emacs-lisp
(evil-global-set-key 'motion "j" 'evil-next-visual-line)
(evil-global-set-key 'motion "k" 'evil-previous-visual-line)
#+end_src

** Modeline
#+begin_src emacs-lisp
(after! doom-modeline
  (display-battery-mode t)
  ;; Also have the file icon
  (setq doom-modeline-major-mode-icon t))
#+end_src

* Org-mode
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

** Heading Variable font sizes

** Tables
#+begin_src emacs-lisp
(setq org-modern-table-vertical 1)
(setq org-modern-table t)
#+end_src

** Zen Mode
#+begin_src emacs-lisp
(setq writeroom-width 75)
(setq writeroom-mode-line t)
#+end_src
** Org Roam UI
#+begin_src emacs-lisp :tangle packages.el
(package! org-roam-ui)
#+end_src
#+begin_src emacs-lisp
(use-package! websocket
  :after org-roam)
(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-sync-theme t)
  (setq org-roam-ui-follow t)
  (setq org-roam-ui-update-on-save t)
  (setq org-roam-ui-open-on-start t))
#+end_src

* Coding
** Corfu - Completion
Use [[kbd:][RET]] to accept completion
#+begin_src emacs-lisp
;; (after! corfu
;;   (setq corfu-preselect 'first))
;; (setq +corfu-want-ret-to-confirm t)
(after! corfu
     (setq corfu-preselect 'first)
     (map! :map corfu-map
           :gi "TAB" #'corfu-insert
           :gi [tab] #'corfu-insert))
#+end_src

** Rust
Enable clippy
#+begin_src emacs-lisp
(after! lsp-rust
  (setq lsp-rust-analyzer-cargo-watch-command "clippy"))
#+end_src

Show latest crate versions in Cargo.toml
#+begin_src emacs-lisp
(add-load-path! "vendor/crates.el")
(require 'crates)

(add-to-list 'auto-mode-alist '("/Cargo\\.toml\\'" . conf-toml-mode))

(defun +doom-enable-crates-mode-maybe ()
  (when (and buffer-file-name
             (string= (file-name-nondirectory buffer-file-name) "Cargo.toml"))
    (crates-mode 1)))

(add-hook 'find-file-hook #'+doom-enable-crates-mode-maybe)
(add-hook 'conf-toml-mode-hook #'+doom-enable-crates-mode-maybe)
(add-hook 'toml-ts-mode-hook #'+doom-enable-crates-mode-maybe)
(add-hook 'toml-mode-hook #'+doom-enable-crates-mode-maybe)

(dolist (buffer (buffer-list))
  (with-current-buffer buffer
    (+doom-enable-crates-mode-maybe)))
#+end_src

** Python
Use =ty= for LSP and =ruff= for formatting
#+begin_src emacs-lisp
(with-eval-after-load 'python
  (set-eglot-client! '(python-mode python-ts-mode) '("ty" "server")))
(with-eval-after-load 'python
  (set-formatter! 'ruff :modes '(python-mode python-ts-mode)))
#+end_src

* Preludes
** Packages.el
#+begin_src emacs-lisp :tangle packages.el
;; To install a package:
;;
;;   1. Declare them here in a `package!' statement,
;;   2. Run 'doom sync' in the shell,
;;   3. Restart Emacs.
;;
;; Use 'C-h f package\!' to look up documentation for the `package!' macro.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;; (package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/radian-software/straight.el#the-recipe-format
;; (package! another-package
;;   :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;; (package! this-package
;;   :recipe (:host github :repo "username/repo"
;;            :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;; (package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;; (package! builtin-package :recipe (:nonrecursive t))
;; (package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see radian-software/straight.el#279)
;; (package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;; (package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;; (unpin! pinned-package)
;; ...or multiple packages
;; (unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;; (unpin! t)
#+end_src
